html/blog_entries/c_style_billion_attack.html
<!DOCTYPE html>
<html>
<head>
<title>C-Style Billion laughs</title>
<!-- 2019-01-23 Wed 17:54 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Kaushik Kulkarni">
<link rel="stylesheet" type="text/css" href="../css/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">C-Style Billion laughs</h1>
<p>
For context see <a href="https://en.wikipedia.org/wiki/Billion_laughs_attack">Billion laughs on Wikipedia.</a>
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="font-weight: bold;">#include</span><span style="font-style: italic;">&lt;stdio.h&gt;</span>

<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol</span> printf(<span style="font-style: italic;">"LOL\n"</span>);
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol1</span> lol lol lol lol lol lol lol lol lol lol
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol2</span> lol1 lol1 lol1 lol1 lol1 lol1 lol1 lol1 lol1 lol1
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol3</span> lol2 lol2 lol2 lol2 lol2 lol2 lol2 lol2 lol2 lol2
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol4</span> lol3 lol3 lol3 lol3 lol3 lol3 lol3 lol3 lol3 lol3
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol5</span> lol4 lol4 lol4 lol4 lol4 lol4 lol4 lol4 lol4 lol4
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol6</span> lol5 lol5 lol5 lol5 lol5 lol5 lol5 lol5 lol5 lol5
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol7</span> lol6 lol6 lol6 lol6 lol6 lol6 lol6 lol6 lol6 lol6
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol8</span> lol7 lol7 lol7 lol7 lol7 lol7 lol7 lol7 lol7 lol7
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">lol9</span> lol8 lol8 lol8 lol8 lol8 lol8 lol8 lol8 lol8 lol8

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {lol9}
</pre>
</div>

<p>
<i>Warning:</i> Do not paste this is an linting-enabled editor.
</p>

<hr >
</div>
<div id="postamble" class="status">
<p class="creator">Last Updated 2019-01-23 Wed 17:54.</br>Created using <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
</div>
</body>
</html>
